[{
  "description": "<p>A point of interest or \"POI\" is represented by a point or <a href=\"http://wiki.openstreetmap.org/wiki/Node\">\"node\"</a> on the map and has geographic coordinates (latitude and longitude). A POI can be a standalone node or it can be part of a <a href=\"http://wiki.openstreetmap.org/wiki/Way\">\"way\"</a> (an ordered list of nodes representing a linear feature or area). Learn more about POIs from <a href=\"http://wiki.openstreetmap.org/wiki/Points_of_interest\">OpenStreetMap's wiki</a>.</p><p>Places supports a wide variety of POIs, a full list of which can be found in our <a href=\"https://docs.google.com/spreadsheets/d/1sQZRUZDe8vPu8PANxoIc5k0Pv85xNd5ae4uGJ0fwEt0/edit#gid=1063193272\">data preset wiki</a> <span class=\"nps-only\">(NPS-only)</span>. Don't see the tag you're looking for? <a href=\"https://github.com/nationalparkservice/places-data/issues/new\">Open an issue on GitHub</a>.</p><p>This guide is intended to serve as a starter kit for contributing to Places, so we are going to review some of the most common/basic tags to add to the map. Use Places Editor's <code>Point</code> tool to add a point to the map:</p><p><img class=\"img-thumbnail\" src=\"assets/img/id_point.jpg\"></p>",
  "id": "poi",
  "name": "Points of Interest",
  "subtypes": [{
    "description": "A campground is an area, usually divided into a number of pitches (or <a href=\"#campsite\">\"campsites\"</a>), where people can camp overnight using tents or camper vans or caravans. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dcamp_site\">OSM wiki</a>.",
    "howToMap": "Add a campground by creating a point in the middle of the area and select \"Campground\" from the \"Select feature type\" menu:",
    "id": "campground",
    "name": "Campground",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "capacity",
      "fee"
    ],
    "presetImage": "preset_campground.jpg",
    "tags": [
      "tourism=camp_site"
    ]
  },
  {
    "description": "A campsite is an individual pitch within a campground where people can camp overnight using tents or camper vans or caravans. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dcamp_site\">OSM wiki</a>.",
    "howToMap": "Add a campsite by creating a point in the middle of the pitch and selecting \"Campsite\" from the \"Select feature type\" menu:",
    "id": "campsite",
    "name": "Campsite",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "capacity",
      "fee"
    ],
    "presetImage": "preset_campsite.jpg",
    "tags": [
      "tourism=camp_site",
      "camp_site=pitch"
    ]
  },
  {
    "description": "A lodge or \"alpine hut\" is a remote building located in the mountains intended to provide board and lodging. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dalpine_hut\">OSM wiki</a>.",
    "howToMap": "Add a lodge by creating a point on top of the associated building and selecting \"Lodge\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "lodge",
    "name": "Lodge",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "presetImage": "preset_lodge.jpg",
    "tags": [
      "tourism=alpine_hut"
    ]
  },

],
  "types": "Point feature"
},{
  "description": "<p>Buildings in Places are intentionally simple. We are primarily concerned with building footprints, while any additional building amenities are added as points of interest on top of the footprint. For example, add <code>shop=general</code> as a point of interest on top of the building footprint instead of <code>building=retail</code> as a tag included in the building footprint polygon to represent a general store (see <a href=\"http://localhost:8888/places-tracing-guide/#store\">store</a> above).</p><p>Trace a building by using the <code>Area</code> tool to trace the building footprint and tag as <code>building=yes</code>.</p><p><img class=\"img-thumbnail\" src=\"assets/img/id_area.jpg\"></p><p>Note: Don't get too carried away with nodes while tracing - keep it simple to conform to the general shape of the building visible from the imagery. More nodes mean more data, which can ultimately slow the database.</p><p>Additionally, if you know the location of the building's entrance or exit you can add it as a vertex on the building footprint polygon in the appropriate location. Tag a building entrance/exit as <code>building=entrance</code>. Learn more from the OSM wiki <a href=\"http://wiki.openstreetmap.org/wiki/Tag:building%3Dentrance\">here</a>.</p>",
  "id": "buildings",
  "name": "Buildings",
  "types": "Area feature"
}]
