[{
  "description": "A point of interest or \"POI\" is represented by a point or \"node\" on the map and has geographic coordinates (latitude and longitude). A POI can be a standalone node or it can be part of a \"way\" (an ordered list of nodes representing a linear feature or area).",
  "howToMap": "Add a point of interest using the \"Point\" tool to create a point on the map and select the appropriate preset from the \"Select feature type\" menu.",
  "featureTypes": "Places supports a wide variety of POIs, a full list of which can be found in our <a href=\"https://docs.google.com/spreadsheets/d/1XFqkmIYMEp73q9flgNto9QJim6N5hbacgkUAgdf0rhE/edit?usp=sharing\" target=\"_blank\">preset spreadsheet</a> <span class=\"nps-only\">(NPS-only)</span>. This guide is intended to serve as a \"starter kit\" for contributing to Places and is intentionally not comprehensive, including only the basic and most common POI types. Don't see the feature you're looking for? <a href=\"npmap@nps.gov\" target=\"_blank\">Send us an email</a> or <a href=\"https://github.com/nationalparkservice/places-data/issues/new\" target=\"_blank\">open an issue on GitHub</a>.<p style=\"margin-top:10px;\"><em>The following are the priority POI types for the NPS.gov Centennial redesign, which will drive individual park pages on the new site:</p><ul><li>Visitor Centers</li><li>Entrance Stations</li><li>Campgrounds</li><li>Trailheads</li></ul></em>",
  "featureTypesId": "POI Types",
  "id": "poi",
  "name": "Points of Interest",
  "types": "Point feature",
  "idToolTypes": [
    "point"
  ],
  "subtypes": [{
    "description": "A visitor center is a building housing information for visitors, typically including some or all of the following: information resources, facilities (e.g. restrooms, drinking water), ranger staff, and exhibits.",
    "howToMap": "Add a visitor center by creating a point on top of the associated building and selecting \"Visitor Center\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "visitor_center",
    "name": "Visitor Center",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "An entrance station is an official entry point into a park.",
    "howToMap": "Add an entrance station by creating a point on top of the entrance and selecting \"Entrance Station\" from the \"Select feature type\" menu:",
    "id": "entrance_station",
    "name": "Entrance Station",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A campground is an area, usually divided into a number of pitches (or <a href=\"#campsite\">\"campsites\"</a>), intended for overnight tent camping.",
    "howToMap": "Add a campground by creating a point in the middle of the area and selecting \"Campground\" from the \"Select feature type\" menu. If the campground is intended for Recreation Vehicles (RVs), use the \"RV Campground\" preset instead.",
    "id": "campground",
    "name": "Campground",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours",
      "Capacity",
      "Fee"
    ]
  },
  {
    "description": "A locale is a named area that is not a city, town, or neighborhood. For example, a park district.",
    "howToMap": "Add a locale by creating a point in the middle of the associated area and selecting \"Locale\" from the \"Select feature type\" menu:",
    "id": "locale",
    "name": "Locale",
    "optionalFields": [
      "Name",
      "Population"
    ]
  },
  {
    "description": "A trailhead is the official point at which a trail begins, often accompanied by trail information and public facilities.",
    "howToMap": "Add a trailhead by creating a point at the start of the trail and selecting \"Trailhead\" from the \"Select feature type\" menu:",
    "approvedUsesDescription": "If the trail is intended for specific uses, add the appropriate \"Approved Use\" using the \"Approved Uses\" form in the \"Edit feature\" menu:",
    "approvedUsesId": "Approved Uses",
    "id": "trailhead",
    "name": "Trailhead",
    "optionalFields": [
      "Name",
      "Operator",
      "Track Type",
      "Surface",
      "Width (Meters)",
      "Incline",
      "Mountain Biking Difficulty",
      "Mountain Biking Uphill Difficulty",
      "IMBA Trail Difficulty",
      "Hiking Difficulty",
      "Trail Visibility",
      "Approved Uses"
    ]
  },
  {
    "description": "A ranger station is a building or facility primarily intended to house park law enforcement and rescue staff, and is typically not open to the public. It can also be as simple as a ranger sitting at a campground kiosk. Ranger stations can be seasonal, and they are commonly confused with visitor centers as both can be located in the same building.",
    "howToMap": "Add a ranger station by creating a point on top of the associated building and selecting \"Ranger Station\" from the \"Select feature type\" menu. In the event the station is co-located with a visitor center, create two coincident points - one for the ranger station and another for the VC. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "ranger_station",
    "name": "Ranger Station",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A restroom is a restroom facility or \"toilet\" open to the public.",
    "howToMap": "Add a restroom by creating a point on top of the associated building and selecting \"Restroom\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "restroom",
    "name": "Restroom",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours",
      "Disposal",
      "Gender",
      "Fee",
      "Allowed Access"
    ]
  },
  {
    "description": "Headquarters is a park's official headquarters.",
    "howToMap": "Add headquarters by creating a point on top of the associated building and selecting \"Headquarters\" from the \"Select feature type\" menu within the \"Building\" category folder. In the event the office is co-located with a visitor center, create two coincident points - one for the headquarters and another for the VC. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "headquarters",
    "name": "Headquarters",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "Information is an information source for visitors, typically an informational board. This is the default and most basic information-related tag, which can be added in more specific forms such as an \"Information Board\" or \"Information Map\", among others.",
    "howToMap": "Add information by creating a point on top of the amenity and selecting \"Information\" from the \"Select feature type\" menu within the \"Information\" category folder:",
    "id": "information",
    "name": "Information",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A campsite is an individual pitch within a campground intended for overnight camping using tents, RVs, etc.",
    "howToMap": "Add a campsite by creating a point in the middle of the pitch and selecting \"Campsite\" from the \"Select feature type\" menu within the \"Land Recreation\" category folder:",
    "id": "campsite",
    "name": "Campsite",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours",
      "Capacity",
      "Fee"
    ]
  },
  {
    "description": "A picnic area is an area that is suitable for outdoors eating and may have a number of other public facilities such as tables, benches, restrooms, grills, water taps, covered pavilions, etc. Or, it may just be a grassy area intended for picnics.",
    "howToMap": "Add a picnic area by creating a point in the middle of the area and selecting \"Picnic Area\" from the \"Select feature type\" menu within the \"Land Recreation\" category folder:",
    "id": "picnic_site",
    "name": "Picnic Area",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours",
      "Fee"
    ]
  },
  {
    "description": "A lodge is a remote building intended to provide seasonal shelter, usually for specific uses. Common examples include commercial fishing, hunting, and wilderness lodges.",
    "howToMap": "Add a lodge by creating a point on top of the associated building and selecting \"Lodge\" from the \"Select feature type\" menu within the \"Building\" category folder. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "lodge",
    "name": "Lodge",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "Lodging is an establishment providing overnight room and board, typically on a short-term basis, along with other guest services. Common examples include hotels and public cabins.",
    "howToMap": "Add lodging by creating a point on top of the associated building and selecting \"Lodging\" from the \"Select feature type\" menu within the \"Building\" category folder. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "lodging",
    "name": "Lodging",
    "optionalFields": [
      "Name",
      "Address",
      "Levels",
      "Smoking"
    ]
  },
  {
    "description": "A store is a general store, typically selling food and other general supplies.",
    "howToMap": "Add a store by creating a point on top of the associated building and selecting \"Store\" from the \"Select feature type\" menu within the \"Service\" category folder. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "store",
    "name": "Store",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "Food service is typically an indoor area within a facility that houses food vendors and provides dining space. Common examples include food courts and snack bars.",
    "howToMap": "Add food service by creating a point on top of the associated building and selecting \"Food Service\" from the \"Select feature type\" menu within the \"Service\" category folder. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "food_service",
    "name": "Food Service",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A litter receptacle is a container for depositing garbage that is accesible to pedestrians. Also known as a trash can, garbage can, waste basket, rubbish bin, or litter bin.",
    "howToMap": "Add a litter receptacle by creating a point on top of the container and selecting \"Litter Receptacle\" from the \"Select feature type\" menu within the \"Service\" category folder:",
    "id": "litter_receptacle",
    "name": "Litter Receptacle",
    "optionalFields": [
      "Name",
      "Operator",
      "Address"
    ]
  },
  {
    "description": "A telephone is a phone available for public use, typically a pay phone on a stand or wall. It may be indoors or outdoors.",
    "howToMap": "Add a telephone by creating a point on top of the telephone and selecting \"Telephone\" from the \"Select feature type\" menu within the \"Service\" category folder. Where several telephones are arranged side by side, arrange several similar points side by side.",
    "id": "telephone",
    "name": "Telephone",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
    ]
  },
  {
    "description": "Potable water is a location at which potable water is available for consumption. Common examples include water fountains and bottle filling stations.",
    "howToMap": "Add potable water by creating a point on top of the amenity and selecting \"Potable Water\" from the \"Select feature type\" menu within the \"Service\" category folder:",
    "id": "potable_water",
    "name": "Potable Water",
    "optionalFields": [
      "Name",
      "Operator",
      "Description",
      "Allowed Access"
    ]
  },
  {
    "description": "A gas station is a facility where vehicles can be refueled.",
    "howToMap": "Add a gas station by creating a point on top of it and selecting \"Gas Station\" from the \"Select feature type\" menu within the \"Service\" category folder. If the gas station includes a building housing a store, see the <a href=\"#store\">store</a> section above to learn how to add it. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "gas_station",
    "name": "Gas Station",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A boat launch is a ramp into the water used to launch a boat, also referred to as a slipway, boat ramp, or boat landing.",
    "howToMap": "Add a boat launch by creating a point in the middle of the ramp and selecting \"Boat Launch\" from the \"Select feature type\" menu within the \"Water Recreation\" category folder.",
    "approvedUsesDescription": "If the boat launch is intended for specific uses, add the appropriate \"Approved Use\" using the \"Approved Water Uses\" form in the \"Edit feature\" menu. Use \"Canoe\" for non-motorized watercraft and \"Motorboat\" for motorized watercraft. Learn more about water trails in the trail section <a href=\"#water_trails\">here</a>.",
    "approvedUsesId": "Approved Water Uses",
    "id": "boat_launch",
    "name": "Boat Launch",
    "optionalFields": [
      "Name",
      "Operator",
      "Width (Meters)",
      "Approved Water Uses"
    ]
  },
  {
    "description": "A populated place is a city, town, neighborhood, or otherwise named populated area.",
    "howToMap": "Add a populated place by creating a point in the middle of the associated area and selecting \"Populated Place\" from the \"Select feature type\" menu:",
    "id": "populated_place",
    "name": "Populated Place",
    "optionalFields": [
      "Name",
      "Population"
    ]
  }
]
},{
  "description": "Buildings in Places are intentionally simple. We are primarily concerned with building footprints, while any additional building amenities are added as points of interest on top of the footprint (see the <a href=\"#poi\">points of interest</a> section to learn more).",
  "howToMap": "Add a building footprint by using the \"Area\" tool to trace the building footprint and select \"Building\" from the \"Select feature type\" menu:",
  "furtherDescription": "<img class=\"img-preset img-responsive img-thumbnail\" src=\"assets/img/preset_building_footprint.jpg\"><div class=\"btn-group dropdown-margin role=\"group\"><div class=\"btn-group\" role=\"group\"><button type=\"button\" class=\"btn btn-default dropdown-toggle\" data-toggle=\"dropdown\" aria-expanded=\"false\">Optional fields<span class=\"caret\"></span></button><ul class=\"dropdown-menu\" role=\"menu\"><li role=\"presentation\" class=\"dropdown-header\">(Optionally) add these fields:</li><li><strong>Name</strong></li><li><strong>Address</strong></a></li><li><strong>Levels</strong></li></ul></div></div><p>Additionally, if you know the location of the building's entrance or exit you can add it as a vertex on the building footprint polygon. Add a building entrance/exit by creating a point at the appropriate location and selecting \"Entrance/Exit\" from the \"Select feature type\" menu.</p><img class=\"img-preset img-responsive img-thumbnail\" src=\"assets/img/preset_entrance_exit.jpg\"><div class=\"btn-group\" role=\"group\"><div class=\"btn-group\" role=\"group\"><button type=\"button\" class=\"btn btn-default dropdown-toggle\" data-toggle=\"dropdown\" aria-expanded=\"false\">Optional fields<span class=\"caret\"></span></button><ul class=\"dropdown-menu\" role=\"menu\"><li role=\"presentation\" class=\"dropdown-header\">(Optionally) add these fields:</li><li><strong>Name</strong></li></ul></div></div>",
  "id": "buildings",
  "name": "Buildings",
  "types": "Area feature",
  "idToolTypes": [
    "area"
  ],
  "gif": "yes"
},{
  "description": "A road is a way intended primarily for passage of motorized vehicles.",
  "howToMap": "Add a road by using the \"Line\" tool to trace its centerline from beginning to end and selecting the appropriate preset from the \"Select feature type\" menu. <em>If a road's classification is unknown, default to the <a href=\"#unknown_road\">\"Unknown Road\"</a> preset.</em>",
  "featureTypes": "Places supports a variety of road classifications, outlined below. Basic road structures, attributes, and topology best practices are also outlined here.",
  "featureTypesId": "Road Types/Attributes",
  "id": "roads",
  "name": "Roads",
  "types": "Line feature",
  "idToolTypes": [
    "line"
  ],
  "subtypes": [{
    "description": "An unknown road is a road whose classification is unknown. <em>Default to this preset when heads-up-digitizing without the necessary context to determine a road's classification</em>.",
    "howToMap": "Add an unknown road by tracing its centerline from beginning to end and selecting \"Unknown Road\" from the \"Select feature type\" menu:",
    "id": "unknown_road",
    "name": "Unknown Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A highway is a major highway, typically with at least two lanes separated by a centerline.",
    "howToMap": "Add a highway by tracing its centerline from beginning to end and selecting \"Highway\" from the \"Select feature type\" menu:",
    "id": "highway",
    "name": "Highway",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A primary road is a major road, typically with at least two lanes separated by a centerline, forming a primary artery of the park and surrounding road network.",
    "howToMap": "Add a primary road by tracing its centerline from beginning to end and selecting \"Primary Road\" from the \"Select feature type\" menu:",
    "id": "primary_road",
    "name": "Primary Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A secondary road is a road that is not a segment of a major route but forms a link in the park and surrounding major road network. It typically has two lanes, separated by a centerline.",
    "howToMap": "Add a secondary road by tracing its centerline from beginning to end and selecting \"Secondary Road\" from the \"Select feature type\" menu:",
    "id": "secondary_road",
    "name": "Secondary Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A minor road is a minor public road, typically at the lowest level of the interconnecting network. It is of lower importance than a secondary road and is not a residential street.",
    "howToMap": "Add a minor road by tracing its centerline from beginning to end and selecting \"Minor Road\" from the \"Select feature type\" menu:",
    "id": "minor_road",
    "name": "Minor Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A residential road is a road strictly intended for access within a residential area (community or neighborhood).",
    "howToMap": "Add a residential road by tracing its centerline from beginning to end and selecting \"Residential Road\" from the \"Select feature type\" menu:",
    "id": "residential_road",
    "name": "Residential Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "An access road is a road accessing a service such as a parking lot, business park, service station, beach, campsite, etc.",
    "howToMap": "Add an access road by tracing its centerline from beginning to end and selecting \"Access Road\" from the \"Select feature type\" menu:",
    "id": "access_road",
    "name": "Access Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Type",
      "Structure"
    ]
  },
  {
    "description": "A private road is the equivalent to what is commonly referred to as a \"maintenance road\" in the Park Service, with access limited to official NPS personnel and closed to the public.",
    "howToMap": "Add a private road by tracing its centerline from beginning to end and selecting \"Private Road\" from the \"Select feature type\" menu:",
    "id": "private_road",
    "name": "Private Road",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Width (Meters)",
      "Speed Limit",
      "One Way",
      "Lanes",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A bridge is a structure used to carry a road, railway, or similar feature over another feature.",
    "howToMap": "Add a bridge by splitting the upper way at each end of the bridge (where it joins solid ground) and selecting \"Bridge\" from the \"Structure\" form in the \"Edit feature\" menu. Remember to maintain the road or trail's existing classification.",
    "id": "bridge",
    "name": "Bridge",
    "optionalFields": [
      "Name",
      "Operator",
      "Address"
    ]
  },
  {
    "description": "A tunnel is an underground or underwater passageway enclosed except for its entrance and exit at each end.",
    "howToMap": "Add a tunnel by splitting the enclosed section of the way and selecting \"Tunnel\" from the \"Structure\" form in the \"Edit feature\" menu. Remember to maintain the road or trail's existing classification.",
    "id": "tunnel",
    "name": "Tunnel",
    "optionalFields": [
      "Name",
      "Operator",
      "Address",
      "Hours"
    ]
  },
  {
    "description": "A crosswalk is a path across an intersection of multiple ways (roads and/or trails) marked off for pedestrian crossing.",
    "howToMap": "Add a crosswalk by using the \"Structure\" form in the \"Edit feature\" menu to add the associated way as a \"Crosswalk\". Remember to maintain the road or trail's existing classification.",
    "id": "crosswalk",
    "name": "Crosswalk"
  },
  {
    "description": "An intersection occurs where two or more ways (roads or trails) meet.",
    "howToMap": "To create a simple intersection between two ways, remember to connect them with a node at the point of intersection. If one way is above another without forming a bridge or tunnel, such as a <a href=\"https://en.wikipedia.org/wiki/Interchange_(road)\" target=\"_blank\">road interchange</a>, do not connect the ways.",
    "id": "intersections",
    "name": "Intersections"
  }
],
  "attributes": [{
    "description": "Surface describes the physical surface of a feature (in this case, a road or trail).",
    "howToMap": "Add a road's surface by selecting the associated way and choosing the appropriate surface type from the \"Surface\" form in the \"Edit feature\" menu:",
    "id": "surface",
    "name": "Surface"
  },
  {
    "description": "One way indicates one way access restriction on roads.",
    "howToMap": "Add one way access by selecting the associated way and clicking \"Assumed to be No\" in the \"One Way\" form of the \"Edit feature\" menu, which will change to \"Yes\" after selection. Note that ways have a directionality, so the direction in which you map the way determines its directionality. However, you can change the <code>{\"oneway\":\"yes\"}</code> tag to <code>{\"oneway\":\"-1\"}</code> in the \"All tags\" table of the \"Edit feature\" menu to reverse its existing directionality (appropriate when a way's directionality already governs another attribute such as a bus route).",
    "id": "oneway",
    "name": "One Way"
  },
  {
    "description": "Lanes indicate the number of traffic lanes on a highway that are available to motorized traffic (bicycle lanes are therefore excluded).",
    "howToMap": "Add the number of lanes a road has by selecting the associated way and entering the appropriate number into the \"Lanes\" form of the \"Edit feature\" menu:",
    "id": "Lanes",
    "name": "Lanes"
  },
  {
    "description": "Speed limit indicates the maximum legal speed limit for general traffic on a road.",
    "howToMap": "Add a road's speed limit by selecting the associated way and entering the appropriate number into the \"Speed Limit\" form of the \"Edit feature\" menu, along with the appropriate unit of measure (<code>mph</code> is the default).",
    "id": "maxspeed",
    "name": "Speed Limit"
  }
]
},{
  "description": "A trail is a way intended primarily for recreational use such as hiking, biking, horseback riding, skiing, etc.",
  "howToMap": "Add a trail by using the \"Line\" tool to trace its centerline from beginning to end and selecting the appropriate preset from the \"Select feature type\" menu. <em>If a trail's classification is unknown, default to the <a href=\"#trail\">\"Trail\"</a> preset.</em> Remember to add a <a href=\"#trailhead\">trailhead</a> to the start of each trail, given an official trailhead is present, along with the associated approved uses.",
  "featureTypes": "Trails generally fall under two \"categories\": \"Trail\" and \"Motorized Trail\", while specific uses (e.g. biking, horseback riding, downhill skiing, etc) define more specific presets. \"Steps\" are also included here.<p><em>Trails are a priority feature type for the NPS.gov Centennial redesign and will drive a \"Trails\" page for every park.</em>",
  "featureTypesId": "Trail Types",
  "id": "trails",
  "name": "Trails",
  "types": "Line feature",
  "idToolTypes": [
    "line"
  ],
  "subtypes": [{
    "description": "A trail is intended for non-motorized traffic including pedestrian use (\"foot traffic\"), biking, or horseback riding.",
    "howToMap": "Add a trail by tracing its centerline from beginning to end and selecting \"Trail\" from the \"Select feature type\" menu within the \"Trail\" category folder:",
    "approvedUsesDescription": "If the trail is intended for specific uses, add them using the \"Approved Uses\" form in the \"Edit feature\" menu:",
    "approvedUsesId": "Approved Uses",
    "id": "trail",
    "name": "Trail",
    "optionalFields": [
      "Name",
      "Operator",
      "Track Type",
      "Surface",
      "Width (Meters)",
      "Incline",
      "Mountain Biking Difficulty",
      "Mountain Biking Uphill Difficulty",
      "IMBA Trail Difficulty",
      "Hiking Difficulty",
      "Trail Visibility",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A motorized trail is permissive to motorized traffic, such as all-terrain and four-wheel drive vehicles, motorcycles, and snowmobiles. It can be permissive to non-motorized traffic as well, but it must be permissive to motorized traffic to warrant this classification.",
    "howToMap": "Add a motorized trail by tracing its centerline from beginning to end and selecting \"Motorized Trail\" from the \"Select feature type\" menu within the \"Trail\" category folder:",
    "approvedUsesDescription": "If the trail is intended for specific uses, add the appropriate \"Approved Use\" using the \"Approved Uses\" form in the \"Edit feature\" menu:",
    "approvedUsesId": "Approved Uses",
    "id": "motorized_trail",
    "name": "Motorized Trail",
    "optionalFields": [
      "Name",
      "Operator",
      "Track Type",
      "Surface",
      "Width (Meters)",
      "Incline",
      "Mountain Biking Difficulty",
      "Mountain Biking Uphill Difficulty",
      "IMBA Trail Difficulty",
      "Hiking Difficulty",
      "Trail Visibility",
      "Approved Uses",
      "Structure"
    ]
  },
  {
    "description": "A sidewalk is a way adjacent to a road dedicated for pedestrian use, usually separated from the road by a curb.",
    "howToMap": "Add a sidewalk by tracing its centerline from beginning to end and selecting the \"Sidewalk\" preset from the \"Select feature type\" menu within the \"Trail\" category folder:",
    "id": "sidewalk",
    "name": "Sidewalk",
    "optionalFields": [
      "Name",
      "Operator",
      "Surface",
      "Lit",
      "Width (Meters)",
      "Approved Uses"
    ]
  },
  {
    "description": "A pedestrian path is a walkway intended for pedestrian use (\"foot traffic\"). It is not intended for hiking (like a \"Trail\") nor is it adjacent to a road (like a \"Sidewalk\"). The walkways covering <a href=\"http://insidemaps.nps.gov/places/editor/#background=mapbox-satellite&map=17.71/-74.02108/40.68823&overlays=park-tiles-overlay\">Governors Island</a> are a good example.",
    "howToMap": "Add a pedestrian path by tracing its centerline from beginning to end and selecting the \"Pedestrian Path\" preset from the \"Select feature type\" menu within the \"Trail\" category folder:",
    "id": "pedestrian_path",
    "name": "Pedestrian Path",
    "optionalFields": [
      "Name",
      "Surface",
      "Lit",
      "Width (Meters)",
      "Structure",
      "Allowed Access"
    ]
  },
  {
    "description": "Steps are a flight of steps along a way intended for pedestrian use.",
    "howToMap": "Add steps by tracing their centerline from beginning to end and selecting the \"Steps\" preset from the \"Select feature type\" menu within the \"Trail\" category folder:",
    "id": "steps",
    "name": "Steps",
    "optionalFields": [
      "Name",
      "Surface",
      "Lit",
      "Width (Meters)",
      "Incline",
      "Allowed Access"
    ]
  }
  ]
},{
  "description": "Parking takes two primary forms in Places: <a href=\"#parking_lot\">parking lots</a> and <a href=\"#parking_aisle\">parking aisles</a>.",
  "howToMap": "Add parking by using the \"Area,\" \"Point,\" and/or \"Line\" tool, depending on the feature type (described below).",
  "featureTypes": "Places supports the following parking types:",
  "featureTypesId": "Parking Types",
  "id": "parking",
  "name": "Parking",
  "types": "Area, Point, and Line feature",
  "idToolTypes": [
    "area",
    "point",
    "line"
  ],
  "subtypes": [{
    "description": "A parking lot is a facility available for use by the public, customers, or other authorized users for the parking of motor vehicles (cars, trucks, motorcycles, etc). This can come in various forms, including a standalone parking lot or garage, among others.",
    "howToMap": "Adding a parking lot is generally a two-step process. First, trace the area footprint and select \"Parking\" from the \"Select feature type\" menu:",
    "furtherDescription": "<img class=\"img-preset img-responsive img-thumbnail\" src=\"assets/img/preset_parking_lot.jpg\"><div class=\"btn-group dropdown-margin role=\"group\"><div class=\"btn-group\" role=\"group\"><button type=\"button\" class=\"btn btn-default dropdown-toggle\" data-toggle=\"dropdown\" aria-expanded=\"false\">Optional fields<span class=\"caret\"></span></button><ul class=\"dropdown-menu\" role=\"menu\"><li role=\"presentation\" class=\"dropdown-header\">(Optionally) add these fields:</li><li><strong>Name</strong></li><li><strong>Operator</strong></li><li><strong>Address</strong></li><li><strong>Capacity</strong></li><li><strong>Fee</strong></li><li><strong>Approved Uses</strong></li></ul></div></div><p>Next, create a point in the center of the area and select \"Parking\" from the \"Select feature type\" menu to add it as a POI. If electric vehicle parking is available, create another point in the center of the area and select \"Electric Vehicle Parking\" from the \"Select feature type\" menu as another POI. If the parking area is undefined simply add the point(s) without defining an area.</p><img class=\"img-preset img-responsive img-thumbnail\" src=\"assets/img/preset_parking_point.jpg\"><div class=\"btn-group\" role=\"group\"><div class=\"btn-group\" role=\"group\"><button type=\"button\" class=\"btn btn-default dropdown-toggle\" data-toggle=\"dropdown\" aria-expanded=\"false\">Optional fields<span class=\"caret\"></span></button><ul class=\"dropdown-menu\" role=\"menu\"><li role=\"presentation\" class=\"dropdown-header\">(Optionally) add these fields:</li><li><strong>Name</strong></li><li><strong>Operator</strong></li><li><strong>Address</strong></li><li><strong>Capacity</strong></li><li><strong>Fee</strong></li><li><strong>Approved Uses</strong></li></ul></div></div>",
    "id": "parking_lot",
    "name": "Parking Lot"
  },{
    "description": "A parking aisle is a subordinated way in a parking lot between rows of parking spaces that vehicles use to drive into and out of the spaces.",
    "howToMap": "Add a parking aisle by tracing its centerline from beginning to end and selecting \"Parking Aisle\" from the \"Select feature type\" menu. The main way(s) in the parking lot, for entering and connecting multiple parking aisles, should be tagged as <a href=\"#access_road\">access roads</a>.",
    "id": "parking_aisle",
    "name": "Parking Aisle",
    "optionalFields": [
      "Name",
      "Surface",
      "One Way",
      "Approved Uses",
      "Structure"
    ]
  }
  ]
}
]
