[{
  "description": "<p>A point of interest or \"POI\" is represented by a point or <a href=\"http://wiki.openstreetmap.org/wiki/Node\">\"node\"</a> on the map and has geographic coordinates (latitude and longitude). A POI can be a standalone node or it can be part of a <a href=\"http://wiki.openstreetmap.org/wiki/Way\">\"way\"</a> (an ordered list of nodes representing a linear feature or area). Learn more about POIs from <a href=\"http://wiki.openstreetmap.org/wiki/Points_of_interest\">OpenStreetMap's wiki</a>.</p><p>Places supports a wide variety of POIs, a full list of which can be found in our <a href=\"https://docs.google.com/spreadsheets/d/1sQZRUZDe8vPu8PANxoIc5k0Pv85xNd5ae4uGJ0fwEt0/edit#gid=1063193272\">data preset wiki</a> <span class=\"nps-only\">(NPS-only)</span>. Don't see the tag you're looking for? <a href=\"https://github.com/nationalparkservice/places-data/issues/new\">Open an issue on GitHub</a>.</p><p>This guide is intended to serve as a starter kit for contributing to Places, so we are going to review some of the most common/basic tags to add to the map. Use Places Editor's <code>Point</code> tool to add a point to the map:</p><p><img class=\"img-thumbnail\" src=\"assets/img/id_point.jpg\"></p>",
  "id": "poi",
  "name": "Points of Interest",
  "subtypes": [{
    "description": "A campground is an area, usually divided into a number of pitches (or <a href=\"#campsite\">\"campsites\"</a>), where people can camp overnight using tents or camper vans or caravans. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dcamp_site\">OSM wiki</a>.",
    "howToMap": "Add a campground by creating a point in the middle of the area and select \"Campground\" from the \"Select feature type\" menu:",
    "id": "campground",
    "name": "Campground",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "capacity",
      "fee"
    ],
    "tags": [
      "tourism=camp_site"
    ]
  },
  {
    "description": "A campsite is an individual pitch within a campground where people can camp overnight using tents or camper vans or caravans. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dcamp_site\">OSM wiki</a>.",
    "howToMap": "Add a campsite by creating a point in the middle of the pitch and selecting \"Campsite\" from the \"Select feature type\" menu:",
    "id": "campsite",
    "name": "Campsite",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "capacity",
      "fee"
    ],
    "tags": [
      "tourism=camp_site",
      "camp_site=pitch"
    ]
  },
  {
    "description": "A lodge or \"alpine hut\" is a remote building located in the mountains intended to provide board and lodging. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dalpine_hut\">OSM wiki</a>.",
    "howToMap": "Add a lodge by creating a point on top of the associated building and selecting \"Lodge\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "lodge",
    "name": "Lodge",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "tourism=alpine_hut"
    ]
  },
  {
    "description": "A picnic area is an area that is suitable for outdoors eating and may have a number of facilities to aid a picnic: tables, benches, restrooms, grills, water taps, covered pavilions, etc. Or, it may just be a grassy area popular for picnics. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dpicnic_site\">OSM wiki</a>.",
    "howToMap": "Add a picnic area by creating a point in the middle of the area and select \"Picnic Area\" from the \"Select feature type\" menu:",
    "id": "picnic_site",
    "name": "Picnic Area",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "fee"
    ],
    "tags": [
      "tourism=picnic_site"
    ]
  },
  {
    "description": "A restroom is a restroom facility or \"toilet\" open to the public. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dtoilets\">OSM wiki</a>.",
    "howToMap": "Add a restroom by creating a point on top of the associated building and selecting \"Restroom\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "restroom",
    "name": "Restroom",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours",
      "toilets:disposal=",
      "male",
      "female",
      "unisex",
      "indoor",
      "access"
    ],
    "tags": [
      "amenity=toilets"
    ]
  },
  {
    "description": "A waste basket is a single small container for depositing garbage that is easily accesible for pedestrians. Similar expressions: rubbish bin, litter bin, trash can, garbage can. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dwaste_basket\">OSM wiki</a>.",
    "howToMap": "Add a waste basket by creating a point on top of the container and selecting \"Waste Basket\" from the \"Select feature type\" menu:",
    "id": "waste_basket",
    "name": "Waste Basket",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "waste",
      "bin"
    ],
    "tags": [
      "amenity=waste_basket"
    ]
  },
  {
    "description": "A trailhead is the point at which a trail begins, where the trail is often intended for hiking, biking, skiing, snowshoeing, snowmobiling, horseback riding, or off-road vehicles. It is currently a <a href=\"http://wiki.openstreetmap.org/wiki/Proposed_features/trailhead\">proposed feature</a>, with no official OSM wiki available.",
    "howToMap": "Add a trailhead by creating a point at the start of the trail and selecting \"Trailhead\" from the \"Select feature type\" menu:",
    "approvedUses": "If the trail is intended for specific uses, add the appropriate \"Approved Use\" using the \"Approved Uses\" form in the \"Edit feature\" menu:",
    "id": "trailhead",
    "name": "Trailhead",
    "optionalTags": [
      "name",
      "operator",
      "tracktype",
      "surface",
      "width",
      "incline",
      "mtb:scale",
      "mtb:scale:uphill",
      "mtb:scale:imba",
      "sac_scale",
      "trail_visibility",
      "access"
    ],
    "tags": [
      "highway=trailhead"
    ]
  },
  {
    "description": "A visitor center is a building housing information for visitors, typically including some or all of the following: information resources, facilities (e.g. restrooms, drinking water), ranger staff, and exhibits. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:information%3Doffice\">OSM wiki</a>.",
    "howToMap": "Add a visitor center by creating a point on top of the associated building and selecting \"Visitor Center\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "visitor_center",
    "name": "Visitor Center",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "tourism=information",
      "information=office"
    ]
  },
  {
    "description": "Information is an information source for visitors, typically an informational board. This is the default and most basic information-related tag, which can be added in more specific forms such as a <a href=\"#visitor_center\">visitor center</a> or <a href=\"http://wiki.openstreetmap.org/wiki/Tag:information%3Dmap\">information map</a>. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:tourism%3Dinformation\">OSM wiki</a>.",
    "howToMap": "Add information by creating a point on top of the amenity and selecting \"Information\" from the \"Select feature type\" menu:",
    "id": "information",
    "name": "Information",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "tourism=information"
    ]
  },
  {
    "description": "A ranger station is a building or facility primarily intended to house park law enforcement and rescue staff, and is typically not open to the public. It can also be as simple as a ranger sitting at a campground kiosk. Ranger stations can be seasonal, and they are commonly confused with visitor centers as both can be located in the same building. Learn more from the  <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dranger_station\">OSM wiki</a>, but keep in mind that definitions can vary between the Park Service and Forest Service, and between parks.",
    "howToMap": "Add a ranger station by creating a point on top of the associated building and selecting \"Ranger Station\" from the \"Select feature type\" menu. In the event the station is co-located with a visitor center, the best practice is to create two coincident points - one for the station and another for the VC.Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "ranger_station",
    "name": "Ranger Station",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "amenity=ranger_station"
    ]
  },
  {
    "description": "An entrance station is an official entry point into a park. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:barrier%3Dentrance\">OSM wiki</a>, but keep in mind that the wiki describes a generalized take while we are targeting official park entrances.",
    "howToMap": "Add an entrance station by creating a point on top of the entrance and selecting \"Entrance Station\" from the \"Select feature type\" menu:",
    "id": "entrance_station",
    "name": "Entrance Station",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "barrier=entrance"
    ]
  },
  {
    "description": "A telephone is a phone available for public use, typically a pay phone on a stand or wall. It may be indoors or outdoors. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dtelephone\">OSM wiki</a>.",
    "howToMap": "Add a telephone by creating a point on top of the telephone and selecting \"Telephone\" from the \"Select feature type\" menu. Where several telephones are arranged side by side, arrange several similar points side by side.",
    "id": "telephone",
    "name": "Telephone",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "indoor"
    ],
    "tags": [
      "amenity=telephone"
    ]
  },
  {
    "description": "Food service is also commonly referred to as a food court. It is typically an indoor area within a facility that houses multiple food vendors and provides a common area for dining. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dfood_court\">OSM wiki</a>.",
    "howToMap": "Add food service by creating a point on top of the associated building and selecting \"Food Service\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "food_service",
    "name": "Food Service",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "amenity=food_court"
    ]
  },
  {
    "description": "A store is a general store, typically selling things like tools, building supplies, clothes, food, and similar items. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:shop%3Dgeneral\">OSM wiki</a>.",
    "howToMap": "Add a store by creating a point on top of the associated building and selecting \"Store\" from the \"Select feature type\" menu. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "store",
    "name": "Store",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "shop=general"
    ]
  },
  {
    "description": "A gas station is a facility where vehicles can be refueled. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Dfuel\">OSM wiki</a>.",
    "howToMap": "Add a gas station by creating a point on top of it and selecting \"Gas Station\" from the \"Select feature type\" menu. If the gas station includes a building housing a store, see the <a href=\"#store\">store</a> section above to learn how to add it. Additionally, trace the building footprint if it has not been added (see the <a href=\"#buildings\">buildings</a> section to learn more about tracing building footprints).",
    "id": "gas_station",
    "name": "Gas Station",
    "optionalTags": [
      "name",
      "operator",
      "addr",
      "opening_hours"
    ],
    "tags": [
      "amenity=fuel"
    ]
  },
  {
    "description": "Drinking water is a location at which potable water is available for consumption. Typically this comes in the form of a water fountain. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:amenity%3Ddrinking_water\">OSM wiki</a>.",
    "howToMap": "Add drinking water by creating a point on top of the amenity and selecting \"Drinking Water\" from the \"Select feature type\" menu:",
    "id": "drinking_water",
    "name": "Drinking Water",
    "optionalTags": [
      "name",
      "operator",
      "description",
      "indoor",
      "access"
    ],
    "tags": [
      "amenity=drinking_water"
    ]
  },
  {
    "description": "A boat launch is a ramp into the water used to launch a boat, also referred to as a slipway, boat ramp, or boat landing. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:leisure%3Dslipway\">OSM wiki</a>.",
    "howToMap": "Add a boat launch by creating a point in the middle of the ramp and selecting \"Boat Launch\" from the \"Select feature type\" menu.",
    "approvedUses": "If the boat launch is intended for specific uses, add the appropriate \"Approved Use\" using the \"Approved Water Uses\" form in the \"Edit feature\" menu. Use \"Canoe\" for non-motorized watercraft and \"Motorboat\" for motorized watercraft. Learn more about water trails in the trail section <a href=\"#water_trails\">here</a>.",
    "id": "boat_launch",
    "name": "Boat Launch",
    "optionalTags": [
      "name",
      "operator",
      "whitewater",
      "width",
      "section_grade"
    ],
    "tags": [
      "leisure=slipway"
    ]
  },
  {
    "description": "A park district or \"locality\" is, generally speaking, a region of a park that has a name. This can come in a variety of forms including an official park administrative unit, a named region of a park, or a city/town neighborhood. Learn more from the <a href=\"http://wiki.openstreetmap.org/wiki/Tag:place%3Dlocality\">OSM wiki</a>, but keep in mind that the wiki describes the OSM-specific context, while we have our own adoption of this for NPS.",
    "howToMap": "Add a park district by creating a point in the middle of the associated area and selecting \"Park District\" from the \"Select feature type\" menu:",
    "id": "park_district",
    "name": "Park District",
    "optionalTags": [
      "name",
      "population"
    ],
    "tags": [
      "place=locality"
    ]
  },
],
  "types": "Point feature"
},{
  "description": "<p>Buildings in Places are intentionally simple. We are primarily concerned with building footprints, while any additional building amenities are added as points of interest on top of the footprint. For example, add <code>shop=general</code> as a point of interest on top of the building footprint instead of <code>building=retail</code> as a tag included in the building footprint polygon to represent a general store (see <a href=\"http://localhost:8888/places-tracing-guide/#store\">store</a> above).</p><p>Trace a building by using the <code>Area</code> tool to trace the building footprint and tag as <code>building=yes</code>.</p><p><img class=\"img-thumbnail\" src=\"assets/img/id_area.jpg\"></p><p>Note: Don't get too carried away with nodes while tracing - keep it simple to conform to the general shape of the building visible from the imagery. More nodes mean more data, which can ultimately slow the database.</p><p>Additionally, if you know the location of the building's entrance or exit you can add it as a vertex on the building footprint polygon in the appropriate location. Tag a building entrance/exit as <code>building=entrance</code>. Learn more from the OSM wiki <a href=\"http://wiki.openstreetmap.org/wiki/Tag:building%3Dentrance\">here</a>.</p>",
  "id": "buildings",
  "name": "Buildings",
  "types": "Area feature"
}]
